#+TITLE: SQLite Raiinbows
#+AUTHOR: ii team
#+DATE: 5 September 2019
#+INCLUDE: "config.org"
#+TODO: TODO(t) NEXT(n) IN-PROGRESS(i) BLOCKED(b) | TADA(d)
#+ARCHIVE: archive/sqlite.archive.org::
#+PROPERTY: header-args:sql-mode+ :results silent :product sqlite :session raiinbow

* json1
  :PROPERTIES:
  :header-args:sql-mode+: :results silent
  :header-args:sql-mode+: :product sqlite
  :header-args:sql-mode+: :session raiinbow
  :header-args:sqlite+: :db (concat (file-name-directory buffer-file-name) "../apps/sqlite/test-raiinbow.db")
  :header-args:sqlite+: :colnames yes
  :header-args:sqlite+: :results table replace
  :END:

#+BEGIN_SRC sqlite
delete from api_swagger;
#+END_SRC

#+BEGIN_SRC sqlite
select JSON_EXTRACT(data, '$.
from api_swagger, json_each(api_swagger.data, '$.paths') limit 1;
#+END_SRC

#+RESULTS:
| key                 | type   | atom |     id |
|---------------------+--------+------+--------|
| definitions         | object |      |      2 |
| info                | object |      |  28384 |
| paths               | object |      |  28390 |
| security            | array  |      | 158969 |
| securityDefinitions | object |      | 158974 |
| swagger             | text   |  2.0 | 158986 |

#+BEGIN_SRC sqlite
.table api_swagger
#+END_SRC

#+RESULTS:
| CREATE TABLE api_swagger (                      |   |
|-------------------------------------------------+---|
| version text NOT NULL                           |   |
| gitref text NOT NULL                            |   |
| ingested_at timestamp DEFAULT CURRENT_TIMESTAMP |   |
| data jsonb NOT NULL                             |   |
| );                                              |   |

** table
#+BEGIN_SRC sqlite
.dbinfo
#+END_SRC

#+RESULTS:
| database page size:  4096     |
|-------------------------------|
| write format:        1        |
| read format:         1        |
| reserved bytes:      0        |
| file change counter: 1        |
| database page count: 2        |
| freelist page count: 0        |
| schema cookie:       1        |
| schema format:       4        |
| default cache size:  0        |
| autovacuum top root: 0        |
| incremental vacuum:  0        |
| text encoding:       1 (utf8) |
| user version:        0        |
| application id:      0        |
| software version:    3022000  |
| number of tables:    1        |
| number of indexes:   0        |
| number of triggers:  0        |
| number of views:     0        |
| schema size:         158      |

** t
#+BEGIN_SRC sqlite :results scalar :colnames no
select 
#+END_SRC

#+RESULTS:
: "{""ex"":""[52,3.14159]""}"

*** keys
#+NAME: top level keys
#+BEGIN_SRC sqlite
select j.key, j.type, j.atom, j.id from api_swagger, json_each(api_swagger.data) as j limit 10;
-- select j.key from api_swagger, json_tree(api_swagger.data) as j;
-- from api_swagger, json_each(api_swagger.data, '$.paths') as paths limit 1;
#+END_SRC

#+RESULTS: top level keys
| key                 | type   | atom |     id |
|---------------------+--------+------+--------|
| definitions         | object |      |      2 |
| info                | object |      |  28384 |
| paths               | object |      |  28390 |
| security            | array  |      | 158969 |
| securityDefinitions | object |      | 158974 |
| swagger             | text   |  2.0 | 158986 |

*** info - title:Kubernetes version:v1.17.0

#+NAME: info
#+BEGIN_SRC sqlite
select j.key, j.type, j.atom, j.id from api_swagger, json_each(api_swagger.data, '$.info') as j limit 10;
-- select j.key from api_swagger, json_tree(api_swagger.data) as j;
-- from api_swagger, json_each(api_swagger.data, '$.paths') as paths limit 1;
#+END_SRC

#+RESULTS: info
| key     | type | atom       |    id |
|---------+------+------------+-------|
| title   | text | Kubernetes | 28386 |
| version | text | v1.17.0    | 28388 |

*** paths

#+NAME: paths
#+BEGIN_SRC sqlite
-- select paths.key, paths.type, paths.atom, paths.value
select ops.key, ops.type, ops.atom, ops.value
from api_swagger
  , json_tree(api_swagger.data, '$.paths') as ops
limit 1;
-- select j.key from api_swagger, json_tree(api_swagger.data) as j;
-- from api_swagger, json_each(api_swagger.data, '$.paths') as paths limit 1;
#+END_SRC

#+RESULTS: paths
| key   | type   | atom |
|-------+--------+------|
| paths | object |      |


